Repository: huahuahu/BirthTracker
Catalog: BirthTrackerPackage/Sources/Localization/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Add a person to start the timeline.
zh_hans: 添加一个联系人以开始生日时间线。

source: Add Birthday
zh_hans: 添加生日

source: Add Person
zh_hans: 添加联系人

source: Appearance
zh_hans: 外观

# appearance.mode.dark
source: Dark
zh_hans: 深色

# appearance.mode.light
source: Light
zh_hans: 浅色

# appearance.mode.system
source: Follow System
zh_hans: 跟随系统

source: Birth date
zh_hans: 出生日期

source: Birthday
zh_hans: 生日

# birthday.age.accessibility.format
source: Turns %lld
zh_hans: 即将 %lld 岁

source: Birthdays
zh_hans: 生日

source: Born for
zh_hans: 已经出生

source: Calendar
zh_hans: 日历

# calendar.kind.buddhist
source: Buddhist
zh_hans: 佛历

# calendar.kind.chinese
source: Chinese
zh_hans: 农历

# calendar.kind.gregorian
source: Gregorian
zh_hans: 公历

# calendar.kind.hebrew
source: Hebrew
zh_hans: 希伯来历

# calendar.kind.islamic
source: Islamic
zh_hans: 伊斯兰历

source: Cancel
zh_hans: 取消

source: Choose Person
zh_hans: 选择联系人

source: Choose which person's birthday this widget shows.
zh_hans: 选择这个小组件显示哪位联系人的生日。

source: Contact Details
zh_hans: 联系人详情

source: Creating test data…
zh_hans: 正在创建测试数据…

source: Creation failed: %@
zh_hans: 创建失败：%@

source: Database
zh_hans: 数据库

source: Days until birthday
zh_hans: 距离生日

source: Debug
zh_hans: 调试

# debug.storage.local
source: Local
zh_hans: 本地

# debug.storage.memory
source: Memory
zh_hans: 内存

source: Edit
zh_hans: 编辑

source: Edit Person
zh_hans: 编辑联系人

source: Generate Test Data
zh_hans: 生成测试数据

source: Known birth year
zh_hans: 知道出生年份

source: Mode
zh_hans: 模式

source: Name
zh_hans: 姓名

source: Name is required.
zh_hans: 姓名不能为空。

source: Next age
zh_hans: 下次年龄

source: No birthday recorded
zh_hans: 未记录生日

source: No Birthdays
zh_hans: 暂无生日

source: No notes
zh_hans: 暂无备注

source: No upcoming birthdays
zh_hans: 暂无即将到来的生日

source: Notes
zh_hans: 备注

source: OK
zh_hans: 好的

source: People
zh_hans: 联系人

source: Person
zh_hans: 联系人

# person.detail.birth.duration.format
source: %lldy %lldm %lldd
zh_hans: %lld 年 %lld 月 %lld 天

# person.detail.days.until.birthday.format
source: %lld days
zh_hans: %lld 天

# person.detail.next.age.format
source: %lld years old
zh_hans: %lld 岁

source: Relationship gender
zh_hans: 称谓性别

# relationship.gender.female
source: Female
zh_hans: 女性

# relationship.gender.male
source: Male
zh_hans: 男性

# relationship.gender.unknown
source: Not specified
zh_hans: 未指定

source: Reset failed: %@
zh_hans: 重置失败：%@

source: Reset Test Data
zh_hans: 重置测试数据

source: Resetting test data…
zh_hans: 正在重置测试数据…

source: Restart Required
zh_hans: 需要重启

source: Retry
zh_hans: 重试

source: Save
zh_hans: 保存

source: See the next birthdays at a glance.
zh_hans: 一眼查看接下来的生日。

source: Selected person is no longer available.
zh_hans: 所选联系人已不在列表中。

source: Settings
zh_hans: 设置

source: Storage location updated. Restart the app to use it.
zh_hans: 存储位置已更新，重启 App 后生效。

source: Test Data Created
zh_hans: Test Data 创建完成

source: Test Data Creation Failed
zh_hans: 创建失败

source: Test Data Reset
zh_hans: 测试数据已重置

source: Test Data Reset Failed
zh_hans: 重置失败

source: Unable to Save
zh_hans: 无法保存

source: Upcoming
zh_hans: 即将到来

source: Upcoming Birthdays
zh_hans: 即将到来的生日

source: Widget preview
zh_hans: Widget 预览

# widget.birth.duration.format
source: Born %lldy %lldm %lldd
zh_hans: 出生 %lld 年 %lld 月 %lld 天
